10/data/attachments/900e2fbffa7de045.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_d5a9c198-a2c1-4b20-afbb-b427d7cda18d</nif:username>
            <nif:friendToBeAdded>Miranda_phone_Actions_57597_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>